Angular.ng-template
dbaeumer.vscode-eslint
esbenp.prettier-vscode
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-python.python
ms-python.vscode-pylance
redhat.java
vscjava.vscode-java-debug
vscode-icons-team.vscode-icons